In [18]:
Â ![png](books.png)

SyntaxError: invalid character in identifier (3968539931.py, line 1)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy_utils import create_database, database_exists

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'Plantdadbo#21' # whatever password you chose during MySQL installation.

connection_str = f'mysql+pymysql://{username}:{password}@localhost/Books'
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/Books)

In [2]:
database_exists(connection_str)

True

In [3]:
df = pd.read_csv('data/users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [4]:
df.to_sql('users', engine, if_exists = 'replace')

3

In [5]:
q = """SELECT * FROM users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [6]:
df = pd.read_csv('data/books.csv')
df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [7]:
df.to_sql('books', engine, if_exists = 'replace')

6

In [8]:
q = """SELECT * FROM books LIMIT 6;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [9]:
df = pd.read_csv('data/authors.csv')
df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [10]:
df.to_sql('authors', engine, if_exists = 'replace')

5

In [11]:
q = """SELECT * FROM authors LIMIT 6;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [12]:
df = pd.read_csv('data/favorites.csv')
df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [13]:
df.to_sql('favorites', engine, if_exists = 'replace')

7

In [14]:
q = """SELECT * FROM favorites LIMIT 6;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5

In [15]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0          author
1         authors
2           books
3            data
4          data-5
5           email
6       favorites
7           title
8           users